loogg/HPM6750_Boot/libraries/hpm_sdk/soc/ip/hpm_adc12_regs.h
/* BUS_RESULT register group index macro definition */
#define ADC12_BUS_RESULT_CHN0 (0UL)
#define ADC12_BUS_RESULT_CHN1 (1UL)
#define ADC12_BUS_RESULT_CHN2 (2UL)
#define ADC12_BUS_RESULT_CHN3 (3UL)
#define ADC12_BUS_RESULT_CHN4 (4UL)
#define ADC12_BUS_RESULT_CHN5 (5UL)
#define ADC12_BUS_RESULT_CHN6 (6UL)
#define ADC12_BUS_RESULT_CHN7 (7UL)
#define ADC12_BUS_RESULT_CHN8 (8UL)
#define ADC12_BUS_RESULT_CHN9 (9UL)
#define ADC12_BUS_RESULT_CHN10 (10UL)
#define ADC12_BUS_RESULT_CHN11 (11UL)
#define ADC12_BUS_RESULT_CHN12 (12UL)
#define ADC12_BUS_RESULT_CHN13 (13UL)
#define ADC12_BUS_RESULT_CHN14 (14UL)
#define ADC12_BUS_RESULT_CHN15 (15UL)
#define ADC12_BUS_RESULT_CHN16 (16UL)
#define ADC12_BUS_RESULT_CHN17 (17UL)
#define ADC12_BUS_RESULT_CHN18 (18UL)

/* SEQ_QUE register group index macro definition */
#define ADC12_SEQ_QUE_CFG0 (0UL)
#define ADC12_SEQ_QUE_CFG1 (1UL)
#define ADC12_SEQ_QUE_CFG2 (2UL)
#define ADC12_SEQ_QUE_CFG3 (3UL)
#define ADC12_SEQ_QUE_CFG4 (4UL)
#define ADC12_SEQ_QUE_CFG5 (5UL)
#define ADC12_SEQ_QUE_CFG6 (6UL)
#define ADC12_SEQ_QUE_CFG7 (7UL)
#define ADC12_SEQ_QUE_CFG8 (8UL)
#define ADC12_SEQ_QUE_CFG9 (9UL)
#define ADC12_SEQ_QUE_CFG10 (10UL)
#define ADC12_SEQ_QUE_CFG11 (11UL)
#define ADC12_SEQ_QUE_CFG12 (12UL)
#define ADC12_SEQ_QUE_CFG13 (13UL)
#define ADC12_SEQ_QUE_CFG14 (14UL)
#define ADC12_SEQ_QUE_CFG15 (15UL)

/* PRD_CFG register group index macro definition */
#define ADC12_PRD_CFG_CHN0 (0UL)
#define ADC12_PRD_CFG_CHN1 (1UL)
#define ADC12_PRD_CFG_CHN2 (2UL)
#define ADC12_PRD_CFG_CHN3 (3UL)
#define ADC12_PRD_CFG_CHN4 (4UL)
#define ADC12_PRD_CFG_CHN5 (5UL)
#define ADC12_PRD_CFG_CHN6 (6UL)
#define ADC12_PRD_CFG_CHN7 (7UL)
#define ADC12_PRD_CFG_CHN8 (8UL)
#define ADC12_PRD_CFG_CHN9 (9UL)
#define ADC12_PRD_CFG_CHN10 (10UL)
#define ADC12_PRD_CFG_CHN11 (11UL)
#define ADC12_PRD_CFG_CHN12 (12UL)
#define ADC12_PRD_CFG_CHN13 (13UL)
#define ADC12_PRD_CFG_CHN14 (14UL)
#define ADC12_PRD_CFG_CHN15 (15UL)
#define ADC12_PRD_CFG_CHN16 (16UL)
#define ADC12_PRD_CFG_CHN17 (17UL)
#define ADC12_PRD_CFG_CHN18 (18UL)

/* SAMPLE_CFG register group index macro definition */
#define ADC12_SAMPLE_CFG_CHN0 (0UL)
#define ADC12_SAMPLE_CFG_CHN1 (1UL)
#define ADC12_SAMPLE_CFG_CHN2 (2UL)
#define ADC12_SAMPLE_CFG_CHN3 (3UL)
#define ADC12_SAMPLE_CFG_CHN4 (4UL)
#define ADC12_SAMPLE_CFG_CHN5 (5UL)
#define ADC12_SAMPLE_CFG_CHN6 (6UL)
#define ADC12_SAMPLE_CFG_CHN7 (7UL)
#define ADC12_SAMPLE_CFG_CHN8 (8UL)
#define ADC12_SAMPLE_CFG_CHN9 (9UL)
#define ADC12_SAMPLE_CFG_CHN10 (10UL)
#define ADC12_SAMPLE_CFG_CHN11 (11UL)
#define ADC12_SAMPLE_CFG_CHN12 (12UL)
#define ADC12_SAMPLE_CFG_CHN13 (13UL)
#define ADC12_SAMPLE_CFG_CHN14 (14UL)
#define ADC12_SAMPLE_CFG_CHN15 (15UL)
#define ADC12_SAMPLE_CFG_CHN16 (16UL)
#define ADC12_SAMPLE_CFG_CHN17 (17UL)
#define ADC12_SAMPLE_CFG_CHN18 (18UL)


#endif /* HPM_ADC12_H */